Revit 2024 API
BuiltInFailures.DimensionFailures.SpotDimensionReferencesNoLongerHorizontal Property
 One or more Spot Dimension references are no longer valid. Spot Dimensions can generally reference only those references which have valid coordinates in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SpotDimensionReferencesNoLongerHorizontal { get; }
Visual Basic
Public Shared ReadOnly Property SpotDimensionReferencesNoLongerHorizontal As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SpotDimensionReferencesNoLongerHorizontal {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace